{
  "title": "U.S. Veterans' Transition to Civilian Life",
  "subtitle": "How it works, what resources exist, and common challenges (USA only)",
  "sections": [
    {
      "id": "timeline",
      "heading": "1. Transition Timeline (U.S. Context)",
      "items": [
        {
          "subheading": "Pre-Separation Phase (6–12 months before discharge)",
          "content": [
            "Transition Assistance Program (TAP): Mandatory for most branches. Covers résumé writing, interviewing skills, financial planning, and an introduction to VA benefits (GI Bill, VA healthcare, etc.). Often includes a 'Benefits Briefing' where VA reps explain education, healthcare, and disability compensation.",
            "Individualized Counseling: Many installations assign a Transition Specialist to create a personalized “Separation Roadmap” — target dates for applying to VA benefits or lining up job interviews."
          ]
        },
        {
          "subheading": "Separation / Early Post-Separation (0–3 months after discharge)",
          "content": [
            "DD-214 & VA Enrollment: Upon discharge, service members receive a DD-214. Submitting this to VA establishes eligibility for most benefits. Within 180 days post-discharge, veterans must enroll in VA healthcare to secure priority access and preserve any service-connected health needs.",
            "Education and Training Kickoff: Many newly separated veterans submit Post-9/11 GI Bill (Chapter 33) applications or apply for Vocational Rehabilitation & Employment (Chapter 31) if they have a service-connected disability. Some enroll immediately in community college or technical schools using GI Bill funds."
          ]
        },
        {
          "subheading": "Medium-Term Adjustment (3–12 months after discharge)",
          "content": [
            "Job Search & Placement: Veterans engage with their local Department of Labor (DOL) One-Stop Career Center. A Veteran Employment Program Manager (VEPM) assists with résumé reviews, interview practice, and apprenticeship referrals. VA’s VR&E (Chapter 31) program (if qualified) helps find, train for, and place veterans into suitable civilian careers.",
            "Benefits Navigation Continues: Filing or appealing disability compensation claims via VA’s eBenefits portal. Applying for VA home loan guarantees or VA-backed mortgages. Using VA’s 'Choice' or 'MISSION Act' to see community providers when VA facilities are far away."
          ]
        },
        {
          "subheading": "Long-Term Reintegration (1 year+ after discharge)",
          "content": [
            "Career & Education Progression: Many veterans either advance in their chosen civilian field or pursue advanced degrees (bachelor’s, master’s) funded by GI Bill or Yellow Ribbon support. Some use SBA resources to start veteran-owned businesses.",
            "Ongoing Health & Wellness: Regular engagement with VA medical centers or community care for chronic, service-connected conditions. Vet Center check-ins for PTSD or military sexual trauma support.",
            "Community & Family Stabilization: Joining local Veteran Service Organizations (VSOs) like VFW or American Legion for peer support, advocacy, and social events. Reestablishing family routines, with VA family counseling if needed."
          ]
        }
      ]
    },
    {
      "id": "resources",
      "heading": "2. Key U.S.-Only Resources & Benefits",
      "items": [
        {
          "subheading": "A. Education & Training",
          "content": [
            "Post-9/11 GI Bill (Chapter 33): Covers full in-state tuition/fees (up to public university cap), a
